$(".btnsub").submit(function () {
  if ($(".q36:checked").length == "") {
    alert(
      "36. โดยรวมแล้วเพื่อนบ้าน/เพื่อนร่วมหอพัก/คนรอบตัวท่าน มีความสัมพันธ์ที่ดีต่อท่านเพียงใด"
    );
    $("#checkq36-1").focus();
    return false;
  }

  if ($(".q37:checked").length == "") {
    alert(
      "37. โดยปกติท่านรู้สึกว่าได้รับมลพิษจากสิ่งแวดล้อม (เช่น ฝุ่น กลิ่น อากาศ เสียง เป็นพิษ)รอบตัวท่านเพียงใด"
    );
    $("#checkq37-1").focus();
    return false;
  }
  if ($(".q38:checked").length == "") {
    alert(
      "38. โดยรวมแล้วท่านรู้สึกปลอดภัยในชีวิตและทรัพย์สินในสังคมที่ท่านอยู่เพียงใด"
    );
    $("#checkq38-1").focus();
    return false;
  }
  if ($(".q39:checked").length == "") {
    alert(
      "39. โดยปกติท่านรู้สึกปลอดภัยจากอุบัติเหตุบนถนนในการใช้ชีวิตประจำวันของท่านเพียงใด"
    );
    $("#checkq39-1").focus();
    return false;
  }
  if ($(".q40:checked").length == "") {
    alert(
      "40. โดยรวมแล้วท่านเคยถูกละเมิดสิทธิหรือคุกคามทางเพศ รวมทั้งคำพูด ท่าที พฤติกรรมข่มขู่หรือบังคับให้มีเพศสัมพันธ์ หรือไม่"
    );
    $("#checkq40-1").focus();
    return false;
  }
  if ($(".q41:checked").length == "") {
    alert(
      "41. โดยรวมแล้วท่านเคยถูกบูลลี่ (Bully) ด้วยคำพูดหรือพฤติกรรมก้าวร้าว จนทำให้ท่านรู้สึกอับอายหรือไม่"
    );
    $("#checkq41-1").focus();
    return false;
  }
  if ($(".q42:checked").length == "") {
    alert(
      "42. โดยรวมแล้วท่านเคยเล่นการพนัน เช่น การพนันออนไลน์ ไพ่ เข้าบ่อน หวยใต้ดิน ฯลฯ หรือไม่"
    );
    $("#checkq42-1").focus();
    return false;
  }
  if ($(".q43:checked").length == "") {
    alert("43. โดยรวมแล้วท่านรู้สึกว่า สังคมไทยทุกวันนี้ มีความสงบสุข เพียงใด");
    $("#checkq43-1").focus();
    return false;
  }
  if ($(".q44:checked").length == "") {
    alert(
      "44. โดยรวมแล้วทุกวันนี้ท่านใช้ชีวิตในสังคมอย่างมีความสุข มากน้อยเพียงใด"
    );
    $("#checkq44-1").focus();
    return false;
  }

  if ($(".cv6:checked").length == "") {
    alert(
      "CV6.สถานการณ์การแพร่ระบาดโควิด-19 มีผลกระทบต่อภาพรวมในมิติสังคมดีของท่านเพียงใด"
    );
    $("#checkcv6-1").focus();
    return false;
  }

  var status = confirm("กรุณายืนยันการบันทึกข้อมูลอีกครั้ง");
  if (status == false) {
    return false;
  } else {
    return true;
  }
});
