$(".btnsub").submit(function () {
  if ($(".q70:checked").length == "") {
    alert(
      " 70. โดยรวมแล้วท่านจะแนะนำญาติ/เพื่อน/คนรู้จักมาเรียนที่มหาวิทยาลัยของท่าน เพียงใด"
    );
    $("#checkq70-1").focus();
    return false;
  }

  if ($(".q71:checked").length == "") {
    alert(
      "71. โดยรวมแล้วหากมีใครกล่าวถึงมหาวิทยาลัยของท่านในทางที่ไม่เหมาะสม ท่านจะปกป้องมหาวิทยาลัยของท่านเพียงใด"
    );
    $("#checkq71-1").focus();
    return false;
  }
  if ($(".q72:checked").length == "") {
    alert(
      "72. โดยรวมแล้วท่านภาคภูมิใจที่ได้เป็นนิสิต/นักศึกษาของมหาวิทยาลัยแห่งนี้ เพียงใด"
    );
    $("#checkq72-1").focus();
    return false;
  }
  if ($(".q73:checked").length == "") {
    alert("73. โดยรวมแล้วท่านรู้สึกอยากมามหาวิทยาลัย มากน้อยเพียงใด");
    $("#checkq73-1").focus();
    return false;
  }
  if ($(".q74:checked").length == "") {
    alert(
      "74. โดยรวมแล้วท่านรู้สึกว่าการตัดสินใจเข้าเรียนที่มหาวิทยาลัยแห่งนี้ตั้งแต่แรกจนถึงปัจจุบันเป็นอย่างไร"
    );
    $("#checkq74-1").focus();
    return false;
  }
  if ($(".q75:checked").length == "") {
    alert(
      "75. โดยรวมแล้วท่านรู้สึกเป็นส่วนหนึ่งของมหาวิทยาลัยที่ท่านเรียนในปัจจุบัน เพียงใด"
    );
    $("#checkq75-1").focus();
    return false;
  }
  if ($(".q76:checked").length == "") {
    alert(
      "76. โดยรวมแล้วท่านทุ่มเทศึกษาเล่าเรียนเพื่อสร้าง/รักษาชื่อเสียงของมหาวิทยาลัยของท่าน เพียงใด"
    );
    $("#checkq76-1").focus();
    return false;
  }
  if ($(".q77:checked").length == "") {
    alert(
      "77. โดยรวมแล้วท่านทุ่มเทคิดใหม่ ทำใหม่ เพื่อสร้างความก้าวหน้าให้กับมหาวิทยาลัยของท่าน เพียงใดใด"
    );
    $("#checkq77-1").focus();
    return false;
  }
  if ($(".q78:checked").length == "") {
    alert("78. โดยรวมแล้ว ในแต่ละวันท่านศึกษาเล่าเรียนอย่างมีเป้าหมาย เพียงใด");
    $("#checkq78-1").focus();
    return false;
  }

  var status = confirm("กรุณายืนยันการบันทึกข้อมูลอีกครั้ง");
  if (status == false) {
    return false;
  } else {
    return true;
  }
});
