$(".btnsub").submit(function () {
  if ($(".q52:checked").length == "") {
    alert(
      "52.การเรียนของท่านมีความท้าทายและส่งเสริมให้ท่านได้เรียนรู้สิ่งใหม่ ๆเพียงใด"
    );
    $("#checkq52-1").focus();
    return false;
  }

  if ($(".q53:checked").length == "") {
    alert(
      "53. ท่านรู้สึกว่าการเรียนของท่านมีความชัดเจนของโอกาสในการประกอบอาชีพในอนาคต และสร้างความมั่นคงในชีวิตเพียงใด"
    );
    $("#checkq53-1").focus();
    return false;
  }
  if ($(".q54:checked").length == "") {
    alert(
      "54. ท่านรู้สึกว่าการเรียนของท่านจะช่วยให้ท่านมีงานทำภายใน 1 ปีหลังเรียนจบ มากน้อยเพียงใด"
    );
    $("#checkq54-1").focus();
    return false;
  }
  if ($(".q55:checked").length == "") {
    alert(
      "55.ท่านสามารถแสดงความคิดเห็นและมีส่วนร่วมกับการเรียนการสอนและการพัฒนาหลักสูตรร่วมกับอาจารย์หรือภาควิชา/คณะ/มหาวิทยาลัย"
    );
    $("#checkq55-1").focus();
    return false;
  }
  if ($(".q56:checked").length == "") {
    alert(
      "56. ท่านได้รับการปฏิบัติอย่างถูกต้องตามสิทธิที่นักศึกษาพึงได้ จากมหาวิทยาลัยของท่าน เพียงใด"
    );
    $("#checkq56-1").focus();
    return false;
  }
  if ($(".q57:checked").length == "") {
    alert("57.ท่านมีเสรีภาพในการสวมหรือไม่สวมเครื่องแบบ เข้าชั้นเรียน เพียงใด");
    $("#checkq57-1").focus();
    return false;
  }
  if ($(".q58:checked").length == "") {
    alert(
      "58.ท่านได้รับการพิจารณาผลการเรียน/คะแนน/เกรด/การเลื่อนชั้นเรียนในปีที่ผ่านมาด้วยความเหมาะสมเพียงใด"
    );
    $("#checkq58-1").focus();
    return false;
  }
  if ($(".q59:checked").length == "") {
    alert(
      "59. ท่านได้รับการดูแลให้คำปรึกษาเมื่อมีปัญหาทางการเรียน/ปัญหาอื่น ๆ จากมหาวิทยาลัยของท่าน เพียงใด"
    );
    $("#checkq59-1").focus();
    return false;
  }
  if ($(".q60:checked").length == "") {
    alert(
      "60. โดยรวมแล้วท่านพึงพอใจกับการให้บริการ/การมีปฏิสัมพันธ์กับบุคลากรของมหาวิทยาลัย เพียงใด"
    );
    $("#checkq60-1").focus();
    return false;
  }
  if ($(".q61:checked").length == "") {
    alert(
      "61. ท่านมองเห็นว่าความรู้ที่ได้รับคุ้มค่ากับการลงทุนทางการศึกษา (ค่าเล่าเรียน/เวลาและความอุตสาหะที่ใช้ไปในการเรียน ฯลฯ) เพียงใด"
    );
    $("#checkq61-1").focus();
    return false;
  }
  if ($(".q62:checked").length == "") {
    alert(
      "62. โดยรวมแล้วท่านได้รับการดูแลเกี่ยวกับสุขภาพที่ดีจากมหาวิทยาลัย เพียงใด"
    );
    $("#checkq62-1").focus();
    return false;
  }

  if ($(".q63:checked").length == "") {
    alert("63.ท่านพึงพอใจต่อสภาพแวดล้อมโดยรวมของมหาวิทยาลัย เพียงใด");
    $("#checkq63-1").focus();
    return false;
  }
  if ($(".q64:checked").length == "") {
    alert(
      "64. โดยรวมแล้วท่านพึงพอใจกับสวัสดิการและสิ่งอำนวยความสะดวกต่าง ๆ ที่มหาวิทยาลัยจัดให้ เพียงใด"
    );
    $("#checkq64-1").focus();
    return false;
  }
  if ($(".q65:checked").length == "") {
    alert(
      "65. โดยรวมแล้วมหาวิทยาลัยของท่านให้ความสำคัญกับการทำงานกลุ่ม/กิจกรรมกลุ่ม/ชมรม/ร่วมแรงร่วมใจทำงานเป็นทีมเพียงใด"
    );
    $("#checkq65-1").focus();
    return false;
  }
  if ($(".q66:checked").length == "") {
    alert(
      " 66. โดยรวมแล้วท่านสนิทกับเพื่อนร่วมชั้นเรียน/เพื่อนในมหาวิทยาลัยของท่าน มากน้อยเพียงใด"
    );
    $("#checkq66-1").focus();
    return false;
  }
  if ($(".q67:checked").length == "") {
    alert(
      "67. โดยรวมแล้วท่านสื่อสารพูดคุย/ปรึกษาหารือ/แลกเปลี่ยนความรู้สึก ความคิดเห็น ได้อย่างสนิทใจกับเพื่อนในมหาวิทยาลัย เพียงใด"
    );
    $("#check67-1").focus();
    return false;
  }
  if ($(".q68:checked").length == "") {
    alert(
      "68.โดยรวมแล้วในมหาวิทยาลัยของท่านมีการถ่ายทอดแลกเปลี่ยนแบบอย่างการเรียนและการใช้ชีวิตในรั้วมหาวิทยาลัยระหว่าง่นพี่รุ่นน้อง เพียงใด"
    );
    $("#check68-1").focus();
    return false;
  }
  if ($(".q69:checked").length == "") {
    alert("69. โดยรวมแล้วท่านเรียนอย่าง มี “ความสุข” มากน้อยเพียงใด");
    $("#check69-1").focus();
    return false;
  }

  if ($(".cv9:checked").length == "") {
    alert(
      "cv9.สถานการณ์การแพร่ระบาดโควิด-19 มีผลกระทบต่อภาพรวมในมิติสังคมดีของท่านเพียงใด"
    );
    $("#checkcv9-1").focus();
    return false;
  }
  var status = confirm("ok");
  if (status == false) {
    return false;
  } else {
    return true;
  }
});
