$(".btnsub").submit(function () {
  if ($(".q79:checked").length == "") {
    alert(
      " 79.โดยเฉลี่ยในหนึ่งสัปดาห์ท่านรู้สึกว่าท่านใช้เวลาในเรื่องเรียน กี่วัน"
    );
    $("#checkq79-1").focus();
    return false;
  }

  if ($(".q80:checked").length == "") {
    alert(
      "80.โดยเฉลี่ยในแต่ละวันท่านรู้สึกว่าท่านใช้เวลาในเรื่องเรียนวันละ กี่ชั่วโมง"
    );
    $("#checkq80-1").focus();
    return false;
  }
  if ($(".q81:checked").length == "") {
    alert(
      "81.โดยเฉลี่ยในแต่ละวันท่านรู้สึกว่าได้พักผ่อน (ไม่รวมการนอนหลับตอนกลางคืน) กี่ชั่วโมง"
    );
    $("#checkq81-1").focus();
    return false;
  }
  if ($(".q82:checked").length == "") {
    alert("82. โดยทั่วไปท่านสามารถบริหารจัดการเวลาได้ มากน้อยเพียงใด");
    $("#checkq82-1").focus();
    return false;
  }
  if ($(".q83:checked").length == "") {
    alert(
      "83. โดยรวมแล้ว ท่านรู้สึกว่าการบริหารจัดการเวลา เป็นเรื่องที่ท้าทาย (ยากสำหรับท่าน) เพียงใด"
    );
    $("#checkq83-1").focus();
    return false;
  }
  if ($(".q84:checked").length == "") {
    alert(
      "84. โดยทั่วไปตารางเรียนและกิจกรรมทางการศึกษาส่งผลกระทบต่อการทำกิจกรรมส่วนตัวของท่าน เพียงใด"
    );
    $("#checkq84-1").focus();
    return false;
  }
  if ($(".q85:checked").length == "") {
    alert(
      "85.มหาวิทยาลัยของท่านมีความยืดหยุ่น ในการเรียนการสอน (ในสถานการณ์ปกติ) เพียงใด "
    );
    $("#checkq85-1").focus();
    return false;
  }
  if ($(".q86:checked").length == "") {
    alert("86.ท่านได้ใช้เวลาทำกิจกรรมนอกห้องเรียนร่วมกับเพื่อนมากน้อยเพียงใด");
    $("#checkq86-1").focus();
    return false;
  }
  if ($(".q87:checked").length == "") {
    alert(
      "87.ท่านได้ใช้เวลาทำกิจกรรมเพื่อเพิ่มพูนความรู้ความสามารถทางวิชาการ เช่น การเรียนพิเศษการเรียนภาษาต่างประเทศ มากน้อยเพียงใด"
    );
    $("#checkq87-1").focus();
    return false;
  }
  if ($(".q88:checked").length == "") {
    alert(
      "88. โดยปกติท่านได้ใช้สิทธิและเสรีภาพในการแสดงความคิดเห็นทางการเมือง "
    );
    $("#checkq88-1").focus();
    return false;
  }

  var status = confirm("กรุณายืนยันการบันทึกข้อมูลอีกครั้ง");
  if (status == false) {
    return false;
  } else {
    return true;
  }
});
