$(".btnsub").submit(function () {
  if ($(".q12:checked").length == "") {
    alert(
      "12. ในช่วง 2 อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านรู้สึกหรือมีอาการเบื่อ ไม่สนใจ ไม่อยากทำอะไรเลยหรือไม่"
    );
    $("#checkq12-1").focus();
    return false;
  }

  if ($(".q13:checked").length == "") {
    alert(
      "13. ในช่วง 2อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านรู้สึกหรือมีอาการเบื่ออาหาร หรือ กินมากเกินไปหรือไม่"
    );
    $("#checkq13-1").focus();
    return false;
  }
  if ($(".q14:checked").length == "") {
    alert(
      "14. ในช่วง 2 อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านรู้สึกหรือมีอาการเหนื่อยง่าย"
    );
    $("#checkq14-1").focus();
    return false;
  }
  if ($(".q15:checked").length == "") {
    alert(
      "15. ในช่วง 2อาทิตย์ที่ผ่านมารวมทั้งวันนี้ท่านรู้สึกหรือมีอาการหลับยาก หรือ หลับ ๆ ตื่น ๆ"
    );
    $("#checkq15-1").focus();
    return false;
  }
  if ($(".q16:checked").length == "") {
    alert(
      "16. ในช่วง 2อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านรู้สึกหรือมีอาการไม่สบายใจ หรือ ท้อแท้ หรือ ซึมเศร้า"
    );
    $("#checkq16-1").focus();
    return false;
  }
  if ($(".q17:checked").length == "") {
    alert(
      "17. ในช่วง 2อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านรู้สึกหรือมีอาการสมาธิไม่ดี เวลาทำอะไร เช่น ดูทีว ฟังเพลง"
    );
    $("#checkq17-1").focus();
    return false;
  }
  if ($(".q18:checked").length == "") {
    alert(
      "18. ในช่วง 2อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านรู้สึกไม่ดีกับตัวเอง คิดว่าตัวเองล้มเหลว"
    );
    $("#checkq18-1").focus();
    return false;
  }
  if ($(".q19:checked").length == "") {
    alert(
      "19. ในช่วง 2อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านรู้สึกว่าทำอะไรช้าลงจนคนอื่นสังเกตเห็นได้ หรือ"
    );
    $("#checkq19-1").focus();
    return false;
  }
  if ($(".q20:checked").length == "") {
    alert(
      "20. ในช่วง 2 อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านรู้สึกว่า ถ้าเราตายไปคงจะดี"
    );
    $("#checkq20-1").focus();
    return false;
  }
  if ($(".q21:checked").length == "") {
    alert(
      "21. ในช่วง 2อาทิตย์ที่ผ่านมารวมทั้งวันนี้ ท่านเคยทำร้ายตัวเอง หรือ เคยพยายามฆ่าตัวตาย"
    );
    $("#checkq21-1").focus();
    return false;
  }

  if ($(".cv2:checked").length == "") {
    alert(
      "CV2.สถานการณ์การแพร่ระบาดโควิด-19 มีผลกระทบต่อภาพรวมในมิติผ่อนคลายดของท่านเพียงใด"
    );
    $("#checkcv2-1").focus();
    return false;
  }

  var status = confirm("กรุณายืนยันการบันทึกข้อมูลอีกครั้ง");
  if (status == false) {
    return false;
  } else {
    return true;
  }
});
